{
    "functionName": "plotCutQE",
    "className": "DataSet",
    "fileName": "/jakob-lass_&_MJOLNIR/MJOLNIR_&_Data_&_DataSet.py",
    "projectName": "repos",
    "Label": false,
    "isTest": false,
    "Body": "\"\"\"Plotting wrapper for the cutQE method. Generates a 2D intensity map with the data cut by cutQE. \n    \n        .. warning::\n           Deprecated! Instead use the plotCutQELine tool with only two q points\n\n        .. note::\n            Positions shown in tool tip reflect the closes bin center and are thus limited to the area where data is present.\n        \n        Args:\n\n            - q1 (3D or 2D array): Start position of cut in format (h,k,l) or (qx,qy) depending on rlu flag.\n            \n            - q2 (3D or 2D array): End position of cut in format (h,k,l) or (qx,qy) depending on rlu flag.\n            \n            - width (float): Full width of cut in q-plane.\n            \n            - minPixel (float): Minimal size of binning along the cutting direction. Points will be binned if they are closer than minPixel.\n\n            - EnergyBins (list): Bin edges between which the 1D constant energy cuts are performed.\n\n        Kwargs:\n\n            - rlu (bool): If True, coordinates given are interpreted as (h,k,l) otherwise as (qx,qy)\n            \n            - ax (matplotlib axis): Figure axis into which the plots should be done (default None). If not provided, a new figure will be generated.\n\n            - dataFiles (list): List of dataFiles to cut (default None). If none, the ones in the object will be used.\n\n            - constantBins (bool): If True only bins of size minPixel is used (default False)\n        \n            - kwargs: All other keywords will be passed on to the ax.errorbar method.\n        \n        Returns:\n            \n            - ax (matplotlib axis): Matplotlib axis into which the plot was put.\n            \n            - Data list (pandas DataFrame): DataFrame containing qx,qy,H,K,L,Intensity,Normalization,Monitor,BinCount,Int,binDistance for 1D cut.\n            \n            - Bin list (n * 3 arrays): n instances of bin edge positions in plane of size (m+1,3), orthogonal positions of bin edges in plane of size (2,2), and energy edges of size (2).\n            \n            - center position (n * 3D arrays): n instances of center positions for the bins.\n\n            - binDistance (n arrays): n instances of arrays holding the distance in q to q1.\n        \"\"\"\nreturn self.plotCutQELine(QPoints=[q1, q2], width=width, minPixel=minPixel,\n    EnergyBins=EnergyBins, rlu=rlu, ax=ax, dataFiles=dataFiles,\n    constantBins=constantBins, **kwargs)\n_tools.KwargChecker(function=plt.errorbar, include=_tools.MPLKwargs)"
}